app/controllers/worksheets_controller.rb

  def set_and_authorize_worksheet
    @worksheet = Worksheet.find(params[:id])
---
SELECT "worksheets".* FROM "worksheets" WHERE "worksheets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_and_authorize_work_group
    @work_group = WorkGroup.find(params[:work_group_id])
---
SELECT "work_groups".* FROM "work_groups" WHERE "work_groups"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]