app/controllers/worksheets_controller.rb

  def index
    @work_group = WorkGroup.find(params[:work_group_id])
---
SELECT "work_groups".* FROM "work_groups" WHERE "work_groups"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]