app/controllers/work_groups_controller.rb

  def index
    @classroom = Classroom.find(params[:classroom_id])
    @work_groups = WorkGroup.all
---
SELECT "work_groups".* FROM "work_groups" ORDER BY "work_groups"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def show
    @work_group = WorkGroup.find(params[:id])
---
SELECT "work_groups".* FROM "work_groups" WHERE "work_groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]